const tou = `## 一、总则

此份协议是注册用户接受 Wenote 网站（以下简称 Wenote）产品和服务时适用的通用条款。因此，请您在注册成为 Wenote 用户前或接受 Wenote 的产品和服务之前，请您详细地阅读本注册用户协议的所有内容。

1. 注册用户了解并同意：
    1. 只要注册用户勾选“同意本协议”复选框并完成注册，注册用户就已接受了本注册用户协议及 Wenote 公布的各项服务规则，并愿意受其约束。如果发生纠纷，注册用户不得以未仔细阅读为由进行抗辩。
    2. 随着市场经营情况的变化， Wenote 有权随时更改本注册用户协议及相关服务规则。修改本注册用户协议时， Wenote 将于相关页面公告修改的事实，有权不对注册用户进行个别通知。注册用户应该在每次登录前查询网站的相关公告，以了解注册用户协议及其他服务规则的变化。
2. 若注册用户不同意本注册用户协议或相关服务规则，或者不同意 Wenote 作出的修改，注册用户可以主动停止使用 Wenote 提供的产品和服务，如果在 Wenote 修改协议或服务规则后，注册用户仍继续使用 Wenote 提供的产品和服务，即表示注册用户同意 Wenote 对本注册用户协议及相关服务规则所做的所有修改。由于注册用户在注册用户协议变更后因未熟悉公告规定而引起的损失， Wenote 将不会承担任何责任。
3. Wenote 的各项电子服务的所有权和运作权归 Wenote。Wenote 提供的服务将完全按照其发布的服务条款和操作规则严格执行。注册用户必须完全同意所有服务条款并完成注册程序，才能成为 Wenote 的注册用户。注册用户确认：本协议条款是处理双方权利义务的当然约定依据，除非违反国家强制性法律，否则始终有效。

## 二、服务说明

1. Wenote 运用自己的操作系统通过国际互联网络为注册用户提供网络服务。同时，注册用户必须：自行配备上网的所需设备，包括个人电脑、调制解调器或其他必备上网装置。自行负担个人上网所支付的与此服务有关的电话费用、网络费用。
2. 基于 Wenote 所提供的网络服务的重要性，注册用户应同意：提供详尽、准确的个人资料。不断更新注册资料，符合及时、详尽、准确的要求。
3. Wenote 对注册用户的电子邮件、手机号等隐私资料进行保护，承诺不会在未获得注册用户许可的情况下擅自将注册用户的个人资料信息出租或出售给任何第三方，但以下情况除外：注册用户同意让第三方共享资料；注册用户同意公开其个人资料，享受为其提供的产品和服务； Wenote 需要听从法庭传票、法律命令或遵循法律程序； Wenote 发现注册用户违反了 Wenote 服务条款或 Wenote 其它使用规定。
4. 关于注册用户隐私的具体协议以 Wenote 的隐私声明为准。如果注册用户提供的资料包含有不正确的信息， Wenote 保留结束注册用户使用网络服务资格的权利。
5. Wenote 所提供的服务仅供用户非商业性使用，用户在未经 Wenote 事先书面同意的情况下，不得以商业性目的使用 Wenote 所提供的服务。

## 三、注册账号

1. 部分 Wenote 服务仅向注册用户提供，如果您使用 Wenote 提供的网络存储空间进行视听节目、文字、美术摄影等内容的上传及传播等，请先根据本协议及其他 Wenote 规则提示的规则、流程注册成为注册用户，并确保注册信息的真实性、正确性及完整性，如果上述注册信息发生变化，您应及时更改。
2. 您应对注册获得的 Wenote 账号（以下简称“账号”）项下的一切行为承担全部责任，不得侵犯包括但不限于 Wenote 在内的任何主体的合法权益。
3. 您理解并同意，您仅享有账号及账号项下由 Wenote 提供的虚拟产品及服务的使用权，账号及该等虚拟产品及服务的所有权归 Wenote 所有（法律法律另有规定的除外）。未经 Wenote 书面同意，您不得以任何形式处置账号的使用权（包括但不限于赠与、出借、转让、销售、抵押、继承、许可他人使用）。如果 Wenote 发现或者有合理理由认为使用者并非账号初始注册人， Wenote 有权在不通知您的情况下，暂停或终止向该注册账号提供服务，并注销该账号。
4. 您应妥善保管账号信息、账号密码以及其他与账号相关的信息、资料。如因您的原因，造成账号信息、资料、数据的变动、灭失或财产损失等，您应立即通知 Wenote 并自行承担相关法律后果。
5. 您同意并承诺做到：
   1. 当您的账号或密码遭到未经授权的使用，或者发生任何安全问题时，您会立即有效地通知到 Wenote ；
   2. 当您每次登录 Wenote 或使用相关服务后，会将有关账号等安全退出；
   3. 您同意接受 Wenote 通过电子邮件、客户端、网页或其他合法方式向您发送通知信息和其他相关信息。
6. 您同意并承诺不从事以下行为：
   1. 冒用他人信息为自己注册 Wenote 账号；
   2. 未经他人合法授权以他人名义注册 Wenote 账号；
   3. 使用同一身份认证信息注册多个 Wenote 账号（包括经 Wenote 审核认定多个 Wenote 账号的实际控制人为同一人的情形）；
   4. 窃取、盗用他人的 Wenote 账号、笔记内容等；
   5. 使用侮辱、诽谤、色情、政治等违反法律、道德及公序良俗的词语注册 Wenote 账号；
   6. 以非法占有 Wenote 相关服务资源为目的，通过正当或非正当手段恶意利用网站漏洞；
    .侵犯他人合法权益的其他内容。
 .您理解并同意， Wenote 有权对违反上述条款的用户作出禁止注册及/或封号的处理。
8. 您了解并知悉，您可以使用账号登录 Wenote 提供的 Wenote 体系下全部产品。
9. 您理解并同意， Wenote 有权在法律允许的最大范围内视情况决定收回账号使用权，无需另行通知用户亦无需征得用户同意。

## 四、Wenote 上的内容

1. Wenote 上的内容是指经由 Wenote 提供的服务，以上传、张贴或任何其他方式传送或传播的任何资讯、资料、文字、软件、音乐、音频、照片、图形、视频、信息、链接或其他资料，无论系公开还是私下传送（以下简称“内容”），内容提供者、上传者应对其提供、上传的内容承担全部责任，如果给 Wenote 造成损失的，还应向 Wenote 承担赔偿责任。对于第三方因用户上传的内容向 Wenote 主张权利的， Wenote 有权在不事先通知内容提供者、上传者的情况下直接采取删除、屏蔽、断开链接等必要措施。
2. 您在 Wenote 上传或发布的内容，您保证对其享有合法的著作权或相应授权， Wenote 有权展示、散布及推广前述内容。
3. 为提高您内容曝光量及发布效率，您同意您在 Wenote 的账号所发布的全部内容均授权 Wenote 以您的账号自动同步发布至 Wenote 运营的全部产品，包括但不限于客户端软件及网站。您在 Wenote 发布、修改、删除内容的操作，均会同步到上述产品。
4. Wenote 无法预先知晓并合理控制经由 Wenote 服务上传之内容，因此，您已预知在使用 Wenote 的服务时，可能会接触到部分令您感到不快、不适或厌恶的内容，您同意放弃由此产生的针对 Wenote 的任何追索权。但 Wenote 有权依法停止传输任何前述内容并采取相应处理，包括但不限于暂停您继续使用 Wenote 的部分或全部服务，保存有关记录并向有关机关报告。

## 五、使用规则

1. 用户在使用 Wenote 服务的过程中，应遵守以下法律法规：
    1. 《中华人民共和国保守国家秘密法》；
    2. 《中华人民共和国著作权法》；
    3. 《中华人民共和国计算机信息系统安全保护条例》；
    4. 《计算机软件保护条例》；
    5. 《网络信息内容生态治理规定》
    6. 《信息网络传播权保护条例》
     .《中华人民共和国网络安全法》；
    8. 其他法律、法规、规章、条例等具有法律效力的规范。

2. 禁止用户从事以下行为：
    1. 制作、上传、复制、传送、传播包含任何反对宪法所确定的基本原则、危害国家安全、泄露国家秘密、颠覆国家政权、破坏国家统一、破坏民族团结、损害国家荣誉和利益、煽动民族仇恨、民族歧视、破坏民族团结、破坏国家宗教政策、宣扬邪教和封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪、侮辱或者诽谤他人，侵害他人合法权益的等法律、行政法规禁止的内容或其他令人反感的包括但不限于资讯、资料、文字、软件、音乐、照片、图形、信息或其他资料；
    2. 以任何方式危害未成年人；
    3. 冒充任何人或机构，或以虚伪不实的方式谎称或使人误认为与任何人或任何机构有关；
    4. 伪造标题或以其他方式操控识别资料，使人误认为该内容为 Wenote 所传送；
    5. 将无权传送的内容（例如内部资料、机密资料）进行上载、张贴、发送电子邮件或以其他方式传送；
    6. 将侵犯任何人的专利、商标、著作权、商业秘密等知识产权的内容加以上载、张贴、发送电子邮件或以其他方式传送；
    7. 将广告函件、促销资料、"垃圾邮件"等，加以上载、张贴、发送电子邮件或以其他方式传送；
    8. 跟踪或以其他方式骚扰他人；
    9. 将有关干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒或其他计算机代码、档案和程序之资料，加以上载、张贴、发送电子邮件或以其他方式传送；
    10. 干扰或破坏 Wenote 服务或与 Wenote 服务相连的服务器和网络，或不遵守本协议之规定；
    11. 未经 Wenote 事先明确书面许可，以任何方式（包括但不限于机器人软件、蜘蛛软件、爬虫软件等任何自动程序、脚本、软件）和任何理由自行或委托他人、协助他人获取平台的服务、内容、数据；
    12. 用户需保证其上传内容不得违反广电总局的相关规定，包括但不限于《互联网视听节目服务管理规定》（广电总局56号令）等，其上传节目应当符合法律、行政法规、部门规章的规定，上传内容不得含有以下内容：
        - 反对宪法确定的基本原则的；
        - 危害国家统一、主权和领土完整的；
        - 泄露国家秘密、危害国家安全或者损害国家荣誉和利益的；
        - 煽动民族仇恨、民族歧视，破坏民族团结，或者侵害民族风俗、习惯的；
        - 宣扬邪教、迷信的；
        - 扰乱社会秩序，破坏社会稳定的；
        - 诱导未成年人违法犯罪和渲染暴力、色情、赌博、恐怖活动的；
        - 侮辱或者诽谤他人，侵害公民个人隐私等他人合法权益的；
        - 危害社会公德，损害民族优秀文化传统的；
        - 有关法律、行政法规和国家规定禁止的其他内容。
   13. 如用户提供的上传内容含有以上违反政策法律法规的信息或者内容的，由用户直接承担以上导致的一切不利后果，如因此给 Wenote 造成不利后果的，用户应负责消除影响，并且赔偿因此导致的一切损失。

3. 用户不得通过任何渠道或媒体（包括但不限于自媒体等）发出“与 Wenote 合作”、“与 Wenote 共同出品”等任何携带“ Wenote ”品牌的字样，如用户需宣传推广合作节目，用户只能在宣传中提及节目本身而不得提及与 Wenote 关系或者擅自以 Wenote 品牌进行推广，凡是用户的发稿带有“ Wenote ”的一切宣传稿件必须通过 Wenote 相应合作部门之书面同意，否则因此给 Wenote 造成的一切损失用户应予以赔偿。

## 六、免责声明

1. Wenote 对于任何包含、经由或连接、下载或从任何与有关本网络服务所获得的任何内容、信息或广告，不声明或保证其正确性或可靠性；并且对于用户经本服务上的广告、展示而购买、取得的任何产品、信息或资料， Wenote 不负保证责任。用户自行负担使用本服务的风险。
2. 除非另有明确的书面说明， Wenote 提供给您的全部产品和服务，均是在“按现状”和“按现有”的基础上提供的。
3. Wenote 对如下事项不做担保（包括但不限于）：
    1. Wenote 提供的网站、客户端等软件虽然均已经过 Wenote 测试，但由于技术本身的局限性， Wenote 不能保证其与其他软硬件、系统完全兼容。如果出现不兼容的情况，用户可将情况报告 Wenote ，以获得技术支持。如果无法解决问题，用户可以选择卸载、停止使用 Wenote 服务。
    2. 使用 Wenote 服务涉及到 Internet 服务，可能会受到各个环节不稳定因素的影响。因不可抗力、黑客攻击、系统不稳定、网络中断、用户关机、通信线路等原因，均可能造成 Wenote 服务中断或不能满足用户要求的情况。Wenote 不保证 Wenote 服务适合用户的使用要求。
    3. 由于 Wenote 提供的客户端等软件可以通过网络途径下载、传播，因此对于从非 Wenote 指定官方站点下载、非 Wenote 指定途径获得的 Wenote 服务相关软件， Wenote 无法保证其是否感染计算机病毒、是否隐藏有伪装的木马程序等黑客软件，也不承担用户由此遭受的一切直接或间接损害赔偿等法律责任。
    4. Wenote 不做任何与 Wenote 服务、产品的安全性、可靠性、及时性和性能有关的担保。
    5. Wenote 不保证其提供的任何产品、服务或其他材料符合用户的期望。
4. 用户使用经由 Wenote 服务下载或取得的任何资料，其风险由用户自行负担，因该使用而导致用户电脑系统损坏或资料流失，用户应负完全责任。
5. 基于以下原因而造成的利润、商业信誉、资料损失或其他有形或无形损失， Wenote 不承担任何直接、间接、附带、衍生或惩罚性的赔偿：
    1. Wenote 服务全部或部分无法使用；
    2. 经由 Wenote 服务购买或取得的任何产品、资料或服务；
    3. 用户资料遭到未授权的使用或修改；
    4. 其他与 Wenote 服务相关的事宜。
6. 用户应妥善保管自己的账号和密码，加强密码安全性，谨防账号泄露或被盗。因用户账号被泄露或被盗而造成的任何损失， Wenote 不承担补偿责任。用户因电信和网通部门的通讯线路故障、网络或电脑故障、系统不稳定、不可抗力（如服务器宕机）等非 Wenote 原因造成账号、账号内财产等丢失、减少的， Wenote 不承担补偿等责任。
7. 用户理解并同意自主选择免费下载和使用 Wenote 服务，风险自负，包括但不限于用户使用 Wenote 服务过程中的行为，以及因使用 Wenote 服务产生的一切后果。如因下载或使用 Wenote 服务而对计算机系统造成的损坏或数据的丢失等，用户须自行承担全部责任。
8. 用户因认证信息不真实而导致账号、账号内财产等丢失、减少而无法找回的， Wenote 不承担任何法律责任。

## 七、服务的变更、中断、终止

1. 您理解并同意， Wenote 基于经营策略的调整，可能会对服务内容进行变更，也可能会中断、中止或终止服务。
2. 您理解并同意，如 Wenote 发生合并、分立、收购、资产转让时， Wenote 可向第三方转让本服务下相关资产； Wenote 亦可在单方通知您后，将本协议下部分或全部服务及相应的权利义务转交由第三方运营或履行。
3. 您理解并同意，如您在使用 Wenote 服务时存在违反法律法规、本协议及其他 Wenote 规则、社会公德、公序良俗和/或侵害他人合法权益等情形， Wenote 有权不经通知而单方中断或终止向您提供全部或部分服务。
4. 您理解并同意，如您实施违反法律法规、社会公德、公序良俗和/或侵害他人合法权益等行为，并因此影响或可能影响 Wenote 和/或他人的名誉、声誉或其他合法权益， Wenote 有权不经通知而单方中断或终止向您提供全部或部分服务。
5. Wenote 终止向您提供服务后，有权根据适用法律的要求删除您的个人信息，或使其匿名化处理，亦有权依照法律规定的期限和方式继续保存您留存于我方平台的其他内容和信息。

## 八、法律管辖和适用

1. 本协议的订立、执行和解释及争议的解决均应适用中国法律。
2. 如发生 Wenote 服务条款与中国法律相抵触时，则这些条款将完全按法律规定重新解释，而其它合法条款则依旧保持对注册用户产生法律效力和影响。
3. 本协议的规定是可分割的，如本协议任何规定被裁定为无效或不可执行，该规定可被删除而其余条款应予以执行。
4. 如双方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向 Wenote 所在地的四川省高级人民法院提起诉讼。

## 九、其他规定

1. 如本用户协议中的任何内容无论因何种原因完全或部分无效或不具有执行力，本用户协议的其余内容仍应有效并且对协议各方有约束力。
2. 本用户协议中的标题仅为方便而设，不具法律或契约效果。
`

export { tou }
